## Pandas Operations

In [9]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head() #show

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df['col2'].unique() # only uniques values
df['col2'].nunique() # how many uniques values
df['col2'].value_counts() # unique and nunique together

array([444, 555, 666])

In [10]:
np.unique(df['col2']) # only uniques values in numpy

array([444, 555, 666])

In [17]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [20]:
def vezes2(x):
    return x*2

In [ ]:
df['col1'].sum() # sum all elements of col1
df['col1'].apply(vezes2) # like map. apply a method to each value
df['col3'].apply(len) # return length of each line from columns 3

In [ ]:
del df['col2'] # deletes

In [24]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [ ]:
df.isnul() # who is null?

In [ ]:
df.dropna() #drop NaN values

In [26]:
df['col1'].fillna(value=df['col1'].mean())

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [34]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [38]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [39]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN